<?php
/**-------------------------------------------------------------------------------------------------------
 * $Id: admin/includes/extra/modules/add_db_fields/bx_products_video.php 1000 2025-06-01 00:00:00Z benax $
 * 
 * ██████╗ ███████╗███╗   ██╗ █████╗ ██╗  ██╗
 * ██╔══██╗██╔════╝████╗  ██║██╔══██╗╚██╗██╔╝
 * ██████╔╝█████╗  ██╔██╗ ██║███████║ ╚███╔╝ 
 * ██╔══██╗██╔══╝  ██║╚██╗██║██╔══██║ ██╔██╗ 
 * ██████╔╝███████╗██║ ╚████║██║  ██║██╔╝ ██╗
 * ╚═════╝ ╚══════╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═╝
 * 
 * modified eCommerce Shopsoftware
 * http://www.modified-shop.org
 * 
 * Copyright (c) 2009 - 2025 [www.modified-shop.org]
 * 
 * -------------------------------------------------------------------------------------------------------
 * Released under the GNU General Public License
 * -------------------------------------------------------------------------------------------------------
 */

  defined('_VALID_XTC') or die('Direct Access to this location is not allowed.');

  if ( defined('MODULE_BX_PRODUCTS_VIDEO_STATUS') && 'true' == MODULE_BX_PRODUCTS_VIDEO_STATUS ) { 
    $add_products_fields[] = 'products_video';
  }