<?php
/* ----------------------------------------------------------------------------------------------
   $Id: includes/extra/define_add_select/bx_products_video.php  1000 2025-06-01 00:00:00Z benax $
 * 
 * ██████╗ ███████╗███╗   ██╗ █████╗ ██╗  ██╗
 * ██╔══██╗██╔════╝████╗  ██║██╔══██╗╚██╗██╔╝
 * ██████╔╝█████╗  ██╔██╗ ██║███████║ ╚███╔╝ 
 * ██╔══██╗██╔══╝  ██║╚██╗██║██╔══██║ ██╔██╗ 
 * ██████╔╝███████╗██║ ╚████║██║  ██║██╔╝ ██╗
 * ╚═════╝ ╚══════╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═╝
 * 
 * modified eCommerce Shopsoftware
 * http://www.modified-shop.org
 * 
 * Copyright (c) 2009 - 2025 [www.modified-shop.org]
 * -------------------------------------------------------------------------------------------
 * Released under the GNU General Public License
 * -------------------------------------------------------------------------------------------
 */

  if ( defined('MODULE_BX_PRODUCTS_VIDEO_STATUS') && 'true' == MODULE_BX_PRODUCTS_VIDEO_STATUS ) {
    $add_select_product[] = 'p.products_video';
  }