<?php
/* -----------------------------------------------------------------------------------------------------
  $Id: /includes/extra/modules/products_info_end/bx_products_video.php 1000 2025-06-01 00:00:00Z benax $
 * 
 * ██████╗ ███████╗███╗   ██╗ █████╗ ██╗  ██╗
 * ██╔══██╗██╔════╝████╗  ██║██╔══██╗╚██╗██╔╝
 * ██████╔╝█████╗  ██╔██╗ ██║███████║ ╚███╔╝ 
 * ██╔══██╗██╔══╝  ██║╚██╗██║██╔══██║ ██╔██╗ 
 * ██████╔╝███████╗██║ ╚████║██║  ██║██╔╝ ██╗
 * ╚═════╝ ╚══════╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═╝
 * 
 * modified eCommerce Shopsoftware
 * http://www.modified-shop.org
 * 
 * Copyright (c) 2009 - 2025 [www.modified-shop.org]
 * -----------------------------------------------------------------------------------------------------
 * Released under the GNU General Public License
 * -----------------------------------------------------------------------------------------------------
 */

 if ( defined('MODULE_BX_PRODUCTS_VIDEO_STATUS') && 'true' == MODULE_BX_PRODUCTS_VIDEO_STATUS ) {

  if (basename($PHP_SELF) == FILENAME_PRODUCT_INFO) {
    
    if( isset($product->data['products_video']) ) {
      $link   = xtc_href_link(FILENAME_PRODUCT_INFO);
      $offset = strlen(FILENAME_PRODUCT_INFO)*-1;
      $url    = substr($link, 0, $offset);
      $src    = $url.'media/products/'.$product->data['products_video'];
      
      $info_smarty->assign('BX_PRODUCTS_VIDEO_SRC', $src);
    }
  }
 }
